# Using a DB in sqlite3

## SQL in sqlite3

In [1]:
%%capture
!apt-get update
!apt-get install -y sqlite3

In [2]:
!sqlite3 --help

Usage: sqlite3 [OPTIONS] [FILENAME [SQL]]
FILENAME is the name of an SQLite database. A new database is created
if the file does not previously exist. Defaults to :memory:.
OPTIONS include:
   --                   treat no subsequent arguments as options
   -A ARGS...           run ".archive ARGS" and exit
   -append              append the database to the end of the file
   -ascii               set output mode to 'ascii'
   -bail                stop after hitting an error
   -batch               force batch I/O
   -box                 set output mode to 'box'
   -column              set output mode to 'column'
   -cmd COMMAND         run "COMMAND" before reading stdin
   -csv                 set output mode to 'csv'
   -deserialize         open the database using sqlite3_deserialize()
   -echo                print inputs before execution
   -init FILENAME       read/process named file
   -[no]header          turn headers on or off
   -help                show this message
   -html                set output mode to HTML
   -interactive         force interactive I/O
   -json                set output mode to 'json'
   -line                set output mode to 'line'
   -list                set output mode to 'list'
   -lookaside SIZE N    use N entries of SZ bytes for lookaside memory
   -markdown            set output mode to 'markdown'
   -maxsize N           maximum size for a --deserialize database
   -memtrace            trace all memory allocations and deallocations
   -mmap N              default mmap size set to N
   -newline SEP         set output row separator. Default: '\n'
   -nofollow            refuse to open symbolic links to database files
   -nonce STRING        set the safe-mode escape nonce
   -no-rowid-in-view    Disable rowid-in-view using sqlite3_config()
   -nullvalue TEXT      set text string for NULL values. Default ''
   -pagecache SIZE N    use N slots of SZ bytes each for page cache memory
   -pcachetrace         trace all page cache operations
   -quote               set output mode to 'quote'
   -readonly            open the database read-only
   -safe                enable safe-mode
   -separator SEP       set output column separator. Default: '|'
   -stats               print memory stats before each finalize
   -table               set output mode to 'table'
   -tabs                set output mode to 'tabs'
   -unsafe-testing      allow unsafe commands and modes for testing
   -version             show SQLite version
   -vfs NAME            use NAME as the default VFS
   -vfstrace            enable tracing of all VFS calls
   -zip                 open the file as a ZIP Archive

In [3]:
!sqlite3 --version

3.47.0 2024-10-21 16:30:22 03a9703e27c44437c39363d0baf82db4ebc94538a0f28411c85dda156f82636e (64-bit)

## Sample database

The [Chinook sample](https://www.sqlitetutorial.net/sqlite-sample-database/)

- Zip file of [sqlite DB](https://www.sqlitetutorial.net/wp-content/uploads/2018/03/chinook.zip)

- [ER diagram](https://www.sqlitetutorial.net/wp-content/uploads/2018/03/sqlite-sample-database-diagram-color.pdf)

- [ER symbols/meanings](https://d2slcw3kip6qmk.cloudfront.net/marketing/pages/chart/erd-symbols/ERD-Notation.PNG)

- [Draw IO](https://app.diagrams.net/) for creating ER diagrams, flowcharts, etc.

In [4]:

![ -f chinook.zip ] ||
!  curl -s -O https://www.sqlitetutorial.net/wp-content/uploads/2018/03/chinook.zip
!unzip -l chinook.zip

/bin/bash: -c: line 2: syntax error: unexpected end of file
Archive:  chinook.zip
  Length      Date    Time    Name
---------  ---------- -----   ----
   884736  2015-11-29 10:53   chinook.db
---------                     -------
   884736                     1 file

In [5]:
!unzip -u chinook.zip

Archive:  chinook.zip

In [6]:
!ls -la

total 2512
drwxrwxr-x 2 rsbii rsbii   4096 Oct 27 09:58 .
drwxrwxr-x 6 rsbii rsbii   4096 Oct 24 17:20 ..
-rw-rw-r-- 1 rsbii rsbii   1311 Oct 24 17:20 3a-GCP.gcloud.combined.txt
-rw-rw-r-- 1 rsbii rsbii 113731 Oct 24 17:20 3a-GCP.gcloud.ipynb
-rw-rw-r-- 1 rsbii rsbii  15550 Oct 24 17:20 3a-sqlite3-Selects.combined.txt
-rw-rw-r-- 1 rsbii rsbii  70222 Oct 24 17:20 3a-sqlite3-Selects.ipynb
-rw-rw-r-- 1 rsbii rsbii   5190 Oct 24 17:20 3b-BigQuery.metadata.combined.txt
-rw-rw-r-- 1 rsbii rsbii  73432 Oct 24 17:20 3b-BigQuery.metadata.ipynb
-rw-rw-r-- 1 rsbii rsbii  13319 Oct 24 17:20 3b-BigQuery-Selects.combined.txt
-rw-rw-r-- 1 rsbii rsbii 293892 Oct 24 17:20 3b-BigQuery-Selects.ipynb
-rw-rw-r-- 1 rsbii rsbii   5319 Oct 24 17:20 3c-BigQuery.Getting.Started.combined.txt
-rw-rw-r-- 1 rsbii rsbii 120090 Oct 24 17:20 3c-BigQuery.Getting.Started.RCitek.ipynb
-rw-rw-r-- 1 rsbii rsbii   9500 Oct 24 17:20 3c-sqlite3-Joins.combined.txt
-rw-rw-r-- 1 rsbii rsbii  48418 Oct 24 17:20 3c-sqlite3-Joins.ipynb
-rw-rw-r-- 1 rsbii rsbii   5069 Oct 24 17:20 3d-BigQuery-Joins.combined.txt
-rw-rw-r-- 1 rsbii rsbii  80841 Oct 24 17:20 3d-BigQuery-Joins.ipynb
-rw-rw-r-- 1 rsbii rsbii  13319 Oct 24 17:20 3d-BigQuery-Selects.combined.txt
-rw-rw-r-- 1 rsbii rsbii 293892 Oct 24 17:20 3d-BigQuery-Selects.ipynb
-rw-rw-r-- 1 rsbii rsbii   5069 Oct 24 17:20 3e-BigQuery-Joins.combined.txt
-rw-rw-r-- 1 rsbii rsbii  80841 Oct 24 17:20 3e-BigQuery-Joins.ipynb
-rw-rw-r-- 1 rsbii rsbii   9612 Oct 24 17:20 3e-sqlite3-chinook.db.combined.txt
-rw-rw-r-- 1 rsbii rsbii  69961 Oct 24 17:20 3e-sqlite3-chinook.db.ipynb
-rw-rw-r-- 1 rsbii rsbii 884736 Nov 29  2015 chinook.db
-rw-rw-r-- 1 rsbii rsbii 305596 Oct 27 12:28 chinook.zip

In [8]:
# Get a list of the tables in the database
%%script sqlite3 --column --header chinook.db
.tables

UsageError: Line magic function `%%script` not found.

In [ ]:
# Show the schema for the entire database
%%script sqlite3 --column --header chinook.db
.schema

:

In [ ]:
# Select the first 10 entries from the employees table
%%script sqlite3 --column --header chinook.db
select *
from employees
limit 10

:

In [ ]:
# Count the number of unique albums
%%script sqlite3 --column --header chinook.db
select count(distinct AlbumID)
from tracks

:

In [ ]:
# Select the first 10 entries from the albums table
%%script sqlite3 --column --header chinook.db
select *
from albums
limit 10

:

In [ ]:
# Select the first 10 entries from the artists table
%%script sqlite3 --column --header chinook.db
select *
from artists
limit 10

:

In [ ]:
# Select the first 10 entries from joining the artists and albums tables
%%script sqlite3 --column --header chinook.db
select *
from artists
join albums
on artists.ArtistID = albums.ArtistID
limit 10

:

In [ ]:
# Select albums by AC/DC
%%script sqlite3 --column --header chinook.db
select *
from artists
join albums
on artists.ArtistID = albums.ArtistID
where Name = 'AC/DC'
limit 10

:

In [ ]:
# Select some fields from the employees table
%%script sqlite3 --column --header chinook.db
select EmployeeId, LastName, FirstName, Title, ReportsTo
from employees

:

In [ ]:
# Select employees and their bosses
%%script sqlite3 --column --header chinook.db
select emp1.EmployeeId, emp1.LastName, emp1.FirstName, emp1.Title, emp1.ReportsTo, emp2.ReportsTo, emp2.EmployeeId, emp2.LastName, emp2.FirstName
from employees as emp1
join employees as emp2
on emp1.ReportsTo = emp2.EmployeeID

:

In [ ]:
# The first three entries from a self cross join of employees
%%script sqlite3 --column --header chinook.db
select *
from employees as emp1
join employees as emp2
limit 3

:

In [ ]:
# Select a few columns from a self cross joins of employees
%%script sqlite3 --column --header chinook.db
select emp1.EmployeeID, emp1.FirstName, emp1.ReportsTo, emp2.EmployeeID, emp2.FirstName
from employees as emp1
join employees as emp2

:

In [ ]:
# Select the first 10 entries from a self cross joins of employees
%%script sqlite3 --column --header chinook.db
select emp1.EmployeeID, emp1.FirstName, emp1.ReportsTo, emp2.EmployeeID, emp2.FirstName
from employees as emp1
join employees as emp2
limit 10

:

In [ ]:
# Select employees and their supervisors
%%script sqlite3 --column --header chinook.db
select emp1.EmployeeID, emp1.FirstName, emp1.ReportsTo, emp2.EmployeeID, emp2.FirstName
from employees as emp1
join employees as emp2
where emp1.ReportsTo = emp2.EmployeeID
order by emp1.EmployeeID

:

### Building a complex join using a CTE

In [ ]:
# Select customers, their rep, and the rep's supervisor
## uses CTEs
%%script sqlite3 --column --header chinook.db

with
emp as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from employees
)

select *
from emp
limit 10

:

In [ ]:
# Select customers, their rep, and the rep's supervisor
## uses CTEs
%%script sqlite3 --column --header chinook.db

with
emp as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from employees
),
reps as (
  select *
  from emp
)

select *
from reps

:

In [ ]:
# Select customers, their rep, and the rep's supervisor
## uses CTEs
%%script sqlite3 --column --header chinook.db

with
emp as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from employees
),
reps as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from emp
),
supervisors as (
  select EmployeeID, FirstName, Lastname
  from emp
)

select *
from supervisors

:

In [ ]:
# Select customers, their rep, and the rep's supervisor
## uses CTEs
%%script sqlite3 --column --header chinook.db

with
emp as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from employees
),
reps as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from emp
),
supervisors as (
  select EmployeeID, FirstName, Lastname
  from emp
),
workers as (
  select r.EmployeeID as "EmpID", r.Firstname as "Rep", r.ReportsTo as "ReportID", s.EmployeeID as "SuperID", s.FirstName as "Supervisor"
  from reps as r
  join supervisors as s
  where r.ReportsTo = s.EmployeeID
)

select *
from workers

:

In [ ]:
# Select customers, their rep, and the rep's supervisor
## uses CTEs
%%script sqlite3 --column --header chinook.db

with
emp as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from employees
),
reps as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from emp
),
supervisors as (
  select EmployeeID, FirstName, Lastname
  from emp
),
workers as (
  select r.EmployeeID as "EmpID", r.Firstname as "Rep", r.ReportsTo as "ReportID", s.EmployeeID as "SuperID", s.FirstName as "Supervisor"
  from reps as r
  join supervisors as s
  where r.ReportsTo = s.EmployeeID
),
cust as (
  select CustomerID, FirstName as "Customer", SupportRepID
  from customers
)

select *
from cust
limit 10

:

In [ ]:
# Select customers, their rep, and the rep's supervisor
## uses CTEs
%%script sqlite3 --column --header chinook.db

with
emp as (
  select EmployeeID, FirstName, Lastname, ReportsTo, Title
  from employees
),
reps as (
  select EmployeeID, FirstName, Lastname, ReportsTo
  from emp
  where Title = "Sales Support Agent"
),
supervisors as (
  select EmployeeID, FirstName, Lastname
  from emp
  where Title != "Sales Support Agent"

),
workers as (
  select r.EmployeeID as "EmpID", r.Firstname as "Rep", r.ReportsTo as "ReportID", s.EmployeeID as "SuperID", s.FirstName as "Supervisor"
  from reps as r
  join supervisors as s
  where r.ReportsTo = s.EmployeeID
),
cust as (
  select CustomerID, FirstName as "Customer", SupportRepID
  from customers
),
cust_rep_super as (
  select Customer, Rep, Supervisor
  from cust
  join workers
  where SupportRepID = EmpID
)

SELECT *
FROM cust_rep_super
limit 10

:

## You Turn

- How many unique albums are in the Tracks table?
- How many tracks are on the album with AlbumID 1?
- Do the totals in the Invoices table add up to the lineitems in the Invoice_Items table?

In [ ]:
# How many unique records are in the Tracks table?
%%script sqlite3 --column --header chinook.db
select count(distinct AlbumID) as unique_albums
from `tracks`
;

:

In [ ]:
# How many unique records are in the Tracks table?
%%script sqlite3 --column --header chinook.db
select count(AlbumID)
from tracks
;

:

In [ ]:
# How many tracks are on the album with AlbumID 1?
%%script sqlite3 --column --header chinook.db
select count(1) as track_count
from tracks
where albumid = 1
;

:

In [ ]:
# Do the totals in the Invoices table add up to the lineitems in the Invoice_Items table?
%%script sqlite3 --column --header chinook.db
select InvoiceID, Total
from invoices
limit 10

:

In [ ]:
# Do the totals in the Invoices table add up to the lineitems in the Invoice_Items table?
%%script sqlite3 --column --header chinook.db
select invoiceID, sum((unitprice * quantity)) as line_total
from invoice_items
group by invoiceid
limit 10

:

In [ ]:
%%script sqlite3 --column --header chinook.db
with
invoices_ as (
  select InvoiceID, Total as Total
  from invoices
),
line_items as (
  select invoiceID, sum((unitprice * quantity)) as line_total
  from invoice_items
  group by invoiceid
),
side_by_side as (
  select *
  from invoices_ as i
  join line_items as li
  on i.invoiceid = li.invoiceid
)
select * from side_by_side
where total != line_total
limit 10

:

In [ ]:
%%script sqlite3 --column --header chinook.db
with track_info as (
    select
        name as trackname,
        composer,
        genreid
    from
        tracks
)
select
    ti.composer,
    g.name as genre,
    count(*) as trackcount
from
    track_info ti
join
    genres g on ti.genreid = g.genreid
where
    ti.composer is not null
group by
    ti.composer, g.name
order by
    trackcount desc
limit 50;

:

In [ ]:
%%script sqlite3 --column --header chinook.db
SELECT
    CASE
        WHEN al.ArtistID IS NULL THEN 'No Artist'
        ELSE 'With Artist'
    END AS AlbumStatus,
    COUNT(*) AS AlbumCount
FROM
    albums al
LEFT JOIN
    artists ar ON al.ArtistID = ar.ArtistID
GROUP BY
    CASE
        WHEN al.ArtistID IS NULL THEN 'No Artist'
        ELSE 'With Artist'
    END;

:

In [ ]:
%%script sqlite3 --column --header chinook.db
SELECT
    CASE
        WHEN al.ArtistID IS NULL THEN 'Without Artist'
        ELSE 'With Artist'
    END AS AlbumStatus,
    COUNT(*) AS AlbumCount
FROM
    albums al
LEFT JOIN
    artists ar ON al.ArtistID = ar.ArtistID
GROUP BY
    CASE
        WHEN al.ArtistID IS NULL THEN 'Without Artist'
        ELSE 'With Artist'
    END

UNION ALL

SELECT NULL, NULL

UNION ALL

SELECT 'Albums Without Artists', COUNT(*) AS AlbumCount
FROM albums
WHERE ArtistID IS NULL;

:

In [ ]:
%%script sqlite3 --column --header chinook.db

: